{"pageProps":{"post":{"id":2,"title":"How Programming Ruined My Life.","date":"2021-05-03","slug":"How-Programming-Ruined-My-Life.","summary":"Okay, the title might have been a slight exaggeration - programming has played a very beneficial role in both my academic and professional development. I have noticed recently, however, that programming has caused a significant decrease to my quality of life.","content":"**Can you see my happiness ? if not then please show my profile photo at about page.**\n\nHi! My name is  Mitul, and I'm a 22 year old developer living in the INDIA. I've been programming  for over just year now, but i started leaning this over 6-7 year ago in my mid-teenage period. I know there is not a great time i worked as a developer i spend, but nowadays in this covid pandemic i noticed some drastically behaviour in my routine. like,\n\n- Wake up, breakfast\n- Workout at home (Not everyday, hardly twice in a weak )\n- Work ..Work...Work...yes Fucking Work\n- Scrolling Instagram & YouTube ( Watching bad ass reels & Please papa dhime lalooooo )\n\nThis schedule has been fairly consistent for a few months now, and I wanted to share some of the issues I've had (as well as some of the methods I'm using to cope).\n\n### Burnout and Irritability\n\nAfter a long day of problem solving, I noticed that I felt both mentally and physically exhausted. This exhaustion destroyed my motivation for other hobbies, and made me more irritable (and therefore unsociable). Instead of spending my time reading, playing games, or talking with friends, I instead tried to numb my stress by endlessly scrolling through Instagram and other social media platforms until I fell asleep. i noticed that in some point of time in a day i always open YouTube and searching Please papa dhime laloooo, i know some of you look that cute or interesting but as i know my self that's so disgusting, i hope i say to my client \"Please client my life lalooo\".\n\n### Dehydration problem.\n\nYeah , i have good level of water in my body but as i said i'm a 90-95 Kg's & 6 feet like a Bug Ass Hole, so yeah i need water in every 30 minutes of time but unpredictability i forgot to drink water so i started 45-45 mins of Japanese rule of water drinking, That rule is said every-time (45 min) you got a pee, at that time beautifully watch that pee, and notice , is the pee is yellow ? is the pee is light yellow ? or creamy beer color ?, Yes i face that all types of color in my pees and you know that's normal in my pee, i know your pee is also  relatable to yellow color, and yes if you r pee is red or blue then you are the bloody legend my dear friend, trust me you can drink that pee and see your life is amazing, by the way i'm joking with blue pee but yes red pee is also available in some people's penis, i guess, but let's forgot about pee color, here my motto is  how to overcome dehydration. so end the end of that sucks bro, i manage my pee color but not my water level, that's the fucking side effect of siting jobs, but yes STAY HYDRATED ðŸ˜ƒ.\n\n### Conclusion.\n\nAs a developer, maintaining your physical and mental health is crucial to staying both productive and happy. Take frequent breaks, regularly exercise, and ensure that you are eating/drinking/sleeping well/Maintaining pee color - your mind will thank you.\n\nHave you been having any issues with burnout, work-life balance, or physical health? Let me know in the message at [Instagram @mitulp236](https://instagram.com/mitulp236)\n\n###  Footnote\nIf you enjoyed reading this, then consider dropping a message to my social media account , i love to hear you,\n\nANY HONESTLY, Yes i'm bored of this fucked off routine but I LOVE PROGRAMMING A LOT and also PLEAE PAPA DHIME LALOOOOOOOOOO  ðŸ˜\n\n\n> DO WHAT YOU LIKE TO DO BUT NEVER EVER FOLLOW 45-45 MIN OF JAPANESE RULE, FORGOT ABOUT YOUR PEE COLOR AND CHILL  bhai EVERYTHING IS ON TRACK AFTER ALL.\n\n> Mitul Patel ( The Broken Developer )\n","tags":["life","coding","programming"],"published_at":"2021-05-03T16:39:40.432Z","created_at":"2021-05-03T16:37:19.034Z","updated_at":"2021-05-03T17:07:03.712Z"}},"__N_SSG":true}